{
    "name": "Deniz Gould",
    "title": "AI/ML-Focused Software Engineer",
    "location": "San Francisco, CA",
    "phone": "+1 (650) 315-3064",
    "email": "deniz.gould@live.com",
    "linkedin": "linkedin.com/in/deniz-gould",
    "website": "www.myWebsiteName.com",
    "objective": "Imagine a world where software anticipates your needs, learns from you, and evolves alongside you—that’s the future I’m building toward. Curiosity is my compass: I explore the boundary between human intelligence and machine “smarts” by dissecting the why behind human decision-making and shaping AI/ML models that learn to think in their own way. As an AI/ML-focused engineer, I bridge human intuition and machine precision, shipping intelligent web applications that make life smoother and more surprising. By day I’m integrating LLMs into natural-language scheduling assistants; by night I’m cooking at high heat, tackling chess and Catan puzzles at the board-game table, or laying down bass and sax riffs. I’m excited to bring this blend of curiosity, creativity, and code to a team tackling real-world challenges—and if you’re as eager as I am to build tech that’s intuitive, inclusive, and just a little bit magical, let’s chat!",
    "education": [
        {
            "degree": "M.S. Computer Science, AI/ML Concentration",
            "school": "University of San Francisco",
            "year": "Expected 2026",
            "focus": "Artificial Intelligence, Machine Learning, Deep Learning",
            "coursework": [
                "Bayesian & Deep Learning",
                "Network Programming",
                "Algorithms"
            ]
        },
        {
            "degree": "B.S. Computer Science",
            "school": "University of the West Indies",
            "years": "2019-2022",
            "focus": "Software Engineering, System Design, Web Development, Cognitive Psychology",
            "coursework": [
                "Artificial Intelligence",
                "Operating Systems",
                "Web Development 1 + 2",
                "Cognitive Psychology",
                "Database Management Systems",
                "Software Engineering"
            ]
        }
    ],
    "skills": {
        "languages": [
            "Python",
            "Java",
            "JavaScript",
            "SQL"
        ],
        "frameworks_tools": [
            "Django",
            "React.js",
            "LangChain",
            "OpenCV",
            "GitHub",
            "REST APIs"
        ],
        "ml_tools": [
            "TensorFlow",
            "PyTorch"
        ],
        "soft_skills": [
            "Clear communication",
            "Collaboration",
            "Leadership",
            "Adaptability",
            "Continuous learning",
            "Problem-solving"
        ],
        "interests": [
            "Cognitive Psychology",
            "Intelligence",
            "Music",
            "Chess"
        ],
        "languages_spoken": [
            "English",
            "Turkish",
            "Conversational French"
        ]
    },
    "projects": [
        {
            "name": "AI-Powered Smart Calendar",
            "stack": [
                "Java",
                "LangChain4j",
                "OpenAI",
                "Google Calendar API"
            ],
            "summary": "Natural-language scheduling assistant that optimizes event planning end-to-end.",
            "metrics": [
                "Processed 10 000+ scheduling requests with 94 % intent-recognition accuracy",
                "Creates or updates events in <2 s, cutting manual setup time by 50 %",
                "Serves 200+ active users with 99.5 % uptime"
            ],
            "longDescription": "Scheduling between multiple people and shifting priorities can be a major time sink. This Java-based microservice wraps OpenAI's LLMs via LangChain4j into a conversational API that interprets plain-English requests - e.g. “Find me a 30-minute slot tomorrow afternoon with Alice and Bob” - and handles availability checks, conflict resolution, and time-zone conversions in under two seconds. With seamless Google Calendar integration and a Spring Boot deployment, it cut manual scheduling overhead by 50% in beta tests while serving 200+ users at 99.5% uptime."
        },
        {
            "name": "Multiplayer Tic-Tac-Toe (Dynamic Piece Sizes)",
            "stack": [
                "Flask",
                "WebSockets",
                "Python"
            ],
            "summary": "Real-time, strategic board game where larger pieces can overtake smaller ones.",
            "metrics": [
                "Supports 100 concurrent players with <150 ms average move-broadcast latency",
                "Extended average session length by 40 % through dynamic piece mechanics",
                "Handles burst traffic of 200 simultaneous games without desync"
            ],
            "longDescription": "Classic Tic-Tac-Toe often ends in predictable draws, so I reimagined it as a Flask + WebSockets real-time game where each cell can host small, medium, or large markers and larger pieces can cover smaller ones. The custom game-state engine synchronizes moves across clients with <150 ms latency, even under 100+ concurrent players, and a responsive HTML5 UI adapts seamlessly to desktops and mobile screens. This layering mechanic drove a 40% increase in average session length and made each match uniquely strategic."
        },
        {
            "name": "Multilingual Translator with AI-Powered Gesture & Speech",
            "stack": [
                "Java",
                "LangChain4j",
                "OpenCV",
                "LLMs"
            ],
            "summary": "In-progress: inclusive translation platform combining gesture recognition and speech.",
            "metrics": [
                "Gesture detection at 30 FPS with 95 % symbol-recognition accuracy",
                "Delivers translations in 5 target languages with 0.92 BLEU score on average",
                "End-to-end latency under 3 s, designed for 100 requests/min throughput"
            ],
            "longDescription": "Inclusive communication means merging vision and voice - and that's exactly what this in-progress platform does. An OpenCV pipeline captures hand gestures at 30 FPS with 95% recognition accuracy, while a speech-to-text + LLM stack (via LangChain4j) delivers translations into five target languages in under three seconds. Built with modular APIs and accessibility first, it's designed to scale to new symbol sets, dialects, and 100 requests/min throughput for truly global, multi-modal conversations."
        }
    ]
}